# BrowserOrganization Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BrowserOrganization Class
Members See Also
---
The organization settings for grouping, sorting, and filtering of items in the project browser.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public class BrowserOrganization : ElementType
```

Visual Basic
---
```text
Public Class BrowserOrganization _
	Inherits ElementType
```

Visual C++
---
```text
public ref class BrowserOrganization : public ElementType
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..ElementType Autodesk.Revit.DB..::..BrowserOrganization
# See Also
BrowserOrganization Members
Autodesk.Revit.DB Namespace